In [79]:
import numpy as np
import pandas as pd

In [80]:
data=pd.read_csv('User_Data - Arindam Dev (1).csv')

In [81]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [82]:
data.Gender
gender = {'Male': 1,'Female': 2}
data.Gender = [gender[item] for item in data.Gender]

In [83]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510       1   19            19000          0
1    15810944       1   35            20000          0
2    15668575       2   26            43000          0
3    15603246       2   27            57000          0
4    15804002       1   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863       2   46            41000          1
396  15706071       1   51            23000          1
397  15654296       2   50            20000          1
398  15755018       1   36            33000          0
399  15594041       2   49            36000          1

[400 rows x 5 columns]

In [84]:
x=data.iloc[:,:4]

In [85]:
x

      User ID  Gender  Age  EstimatedSalary
0    15624510       1   19            19000
1    15810944       1   35            20000
2    15668575       2   26            43000
3    15603246       2   27            57000
4    15804002       1   19            76000
..        ...     ...  ...              ...
395  15691863       2   46            41000
396  15706071       1   51            23000
397  15654296       2   50            20000
398  15755018       1   36            33000
399  15594041       2   49            36000

[400 rows x 4 columns]

In [86]:
y=data.iloc[:,4:]

In [87]:
y.head(10)

   Purchased
0          0
1          0
2          0
3          0
4          0
5          0
6          0
7          1
8          0
9          0

In [88]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.20,random_state=10)

In [89]:
len(data)

400

In [90]:
len(x_train)

320

In [91]:
len(x_test)

80

In [92]:
320+80

400

In [93]:
from sklearn.svm import SVC

In [94]:
clasvm=SVC(kernel='linear')

In [95]:
clasvm.fit(x_train,y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='linear',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [97]:
print(clasvm.score(x_test,y_test)*100)

80.0

We are getting an accuracy score of 80.00%